---
kind: method
id: M:Autodesk.Revit.DB.UnitUtils.GetAllDisciplines
source: html/5b80ebe4-b085-5851-b412-0ad1dd5025bf.htm
---
# Autodesk.Revit.DB.UnitUtils.GetAllDisciplines Method

Gets the identifiers of all available disciplines.

## Syntax (C#)
```csharp
public static IList<ForgeTypeId> GetAllDisciplines()
```

## Returns
The discipline identifiers.